openesb/Tienda_00/AplicacionTuLibroOnline/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ven="http://j2ee.netbeans.org/wsdl/ServiciosVenta/DescriptorBPEL/VentaLibrosWSDL">
  <soapenv:Body>
    <ven:VentaLibrosWSDLOperation>
      <ISBN>123</ISBN>
      <idCliente>123</idCliente>
      <unidades>12</unidades>
      <precioUnidad>23</precioUnidad>
    </ven:VentaLibrosWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>